tap "anomalyco/tap"
tap "dlvhdr/formulae"
tap "dopplerhq/cli"
tap "gentleman-programming/tap"
tap "libsql/sqld"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "tursodatabase/tap"
brew "atuin", restart_service: :changed
brew "bat"
brew "cocoapods"
brew "deno"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "gnupg"
brew "go"
brew "hledger"
brew "node", link: false
brew "jupyterlab"
brew "lazydocker"
brew "lazygit"
brew "libpq", link: true
brew "lsd"
brew "mise"
brew "mole"
brew "tree-sitter"
brew "neovim"
brew "openjdk"
brew "openjdk@17"
brew "openjdk@21"
brew "pnpm"
brew "pyenv"
brew "python@3.12", link: false
brew "railway"
brew "ripgrep"
brew "sd"
brew "starship", link: false
brew "stow"
brew "tree"
brew "wget"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "zig"
brew "zoxide"
brew "zsh"
brew "anomalyco/tap/opencode"
brew "dlvhdr/formulae/diffnav"
brew "dopplerhq/cli/doppler"
brew "gentleman-programming/tap/engram"
brew "gentleman-programming/tap/gentle-ai"
brew "gentleman-programming/tap/gga"
brew "oven-sh/bun/bun"
brew "tursodatabase/tap/turso"
cask "nikitabobko/tap/aerospace"
cask "gentleman-programming/tap/engram"
cask "flutter"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "localsend"
cask "qutebrowser"
cask "wezterm"
cask "zed"
go "golang.org/x/tools/cmd/goimports"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "nerdfix"
cargo "tree-sitter-cli"
